app/controllers/api/questions_controller.rb

SELECT "questions".* FROM "questions"
---
  def index
    @questions = Question.all()