app/controllers/api/solutions_controller.rb

  def create
    author_id = current_user.id
    question_id = params[:questionId]
    body = params[:body]
    tests = params[:tests]
    results = Sandbox.runTests(body, tests)
    passing = results.all? { |result| result == {success: true} }
    if passing
      @solution = Solution.new({
        author_id: author_id,
        question_id: question_id,
        body: body
      })
      if @solution.save
---
INSERT INTO "solutions" ("author_id", "question_id", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["author_id", 3], ["question_id", 1], ["body", "\n    def self.double(num)\n      2 * num\n    end\n  "], ["created_at", "2015-10-16 00:04:14.696389"], ["updated_at", "2015-10-16 00:04:14.696389"]]